<template>
  <!-- 提示弹层 -->
  <div class="introduction" v-show="isShowIntr">
    <div class="intr-mask">
      <div v-show="questionOragree==='agreement'">
        <h3>小伙伴团报规则&服务条款 <img src="@/assets/img/close@2x.png" @click="close"></h3>
        <div class="content agreement">
        <p> 
          小伙伴团报规则&服务条款
        </p>
        <p>1.朴新教育科技集团有限公司（以下称：朴新教育）将按照本次团报规则&服务条款的相关规定服务于参与本次团报活动的学员（以下简称：团报参与者）。团报参与者在登陆朴新终端（朴新终端包括但不限于朴新官方服务号、朴新微信小程序等）注册信息时点击“同意”按钮即表示团报参与者完全接受本服务条款的全部内容。</p>
        <p>
        2.本次团报优惠名额有限，欲报从速，满班即封。团报优惠不得与其它优惠同时使用，且所报班级需为同一班级（包含科目、年级、校区等班级信息均需完全一致）。仅限2-3人团报，可以为1名老生带1或2名新生，也可以2名或3名新生共同报名。原班费用根据团报人数均分。举例：五年级语文1500元/科，2人团报750元/人；3人团报500元/人。</p>
        <p>
        3.新老生全额付款后即可发起线上团报，跨科目团报可在商城中自行查看产品并发起。</p>
        <p>
        4.参与团报的新老生需在指定时间内到线下任一校区前台领取团报助学金。</p>
        <p>
        5.团报人员中有退班情况，其他小伙伴不再享受相应优惠，并需补齐差价。详细转、退、返规则以校区现场说明为准。</p>
        <p>
        6.团报参与者若发生舞弊行为（舞弊行为包括但不限于提供虚假身份、冒用他人信息等），朴新教育将有权终止本次小伙伴团报优惠权利，无需对团报参与者承担任何责任。</p>
        <p>
        7.团报参与者在活动过程中，必须遵循以下原则：</p>
        <p>
        7.1 遵守中国有关的法律和法规；</p>
        <p>
        7.2 遵守所有与网络服务相关的服务条款、规定和程序；</p>
        <p>
        7.3 不得利用朴新教育活动，进行任何可能对移动网正常运转造成不利影响的行为；</p>
        <p>
        7.4不得利用朴新教育提供的移动服务平台上传、展示或传播任何虚假、骚扰、中伤他人、辱骂、恐吓、庸俗淫秽等非法信息资料。</p>
        <p>
        7.5隐私保护：保护团报参与者隐私是朴新教育此项活动的一项基本政策，朴新教育保证不对外公开或向第三方提供团报参与者在使用移动网服务时存储在朴新教育的内部非公开内容，但下列情况除外：</p>
        <p>
        7.6.1 事先获得团报参与者的明确授权；</p>
        <p>
        7.6.2 根据有关的法律法规要求；</p>
        <p>
        7.6.3 按照相关政府主管部门的要求；</p>
        <p>
        7.6.4 为维护朴新教育的合法权益。</p>
        <p>
        7.7 在不透露单个团报参与者隐私资料的前提下，朴新教育有权对整个数据库进行分析。</p>
        <p>
        8.朴新教育无法担保移动网服务不会中断，对移动网服务的及时性、安全性、准确性也都不作担保。对于因不可抗力或朴新教育不能控制的原因造成的移动网服务中断或其它缺陷，朴新教育不承担任何责任，但将尽力减少因此而给团报参与者造成的损失和影响。</p>
        <p>
        9.通知送达：朴新教育对于团报情况会及时发布在个人首页“我的拼团“中，请参与团报者及时刷新关注。</p>
        <p>
        10.其他规定：如本团报规则&服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本团报规则&服务条款的其余条款仍应有效并且有约束力。
        </p>
        </div>
      </div>

      <div v-show="questionOragree==='question'">
        <h3>常见问题&解答
          <img src="@/assets/img/close@2x.png" @click="close"></h3>
        <div class="content">
        <h4> 我是老生，如何发起拼团</h4>
        <p>1.进入“我的“个人页面</p>
        <p>2.点击个人页面上方“我要开团”</p>
        <p>3.选择您已支付的班级产品，一键生成海报</p>
        <p>4.保存海报，推送至朋友圈或直接发给好友，寻找小伙伴拼团</p>
        <p>5.等待小伙伴线上支付成功即视为拼团成功</p>
        <h4>我是新生，如何参团</h4>
        <p>1.查看朋友圈“小伙伴计划”活动海报
        </p>
        <p>2.长按识别或扫二维码
        </p>
        <p>3.填写信息，验证学员身份
        </p>
        <p>4.支付页面支付款项
        </p>
        <p>5.收到提示，参团成功
        </p>
        <h4>已报课程可以发起几次拼团？</h4>
        <p>已报课程仅能发起一次拼团，团报人数上限为3人/团</p>
        <h4>还想拼团其他科目怎么办？</h4>
        <p>进入“商城”页面，查找相应课程，原价缴费报入，立刻发起小伙伴团报，领取助学金</p>
        <h4>我在线下或其他途径查到的预报班级，可以在“小伙伴计划”中发起团报优惠吗？</h4>
        <p>1. 考虑到班级名额的限制，不是所有班级都在“小伙伴计划”优惠活动内；
        </p>
        <p>2. 参与“小伙伴计划”的课程均在商城页面中显示，未显示的班级不参与本次优惠活动。
        </p>
        <h4>如何查看我的拼团情况
        </h4>
        <p>进入“我的“个人页面，在”我的拼团“中直接查看即可。
        </p>
        <h4>什么情况下算拼团失败
        </h4>
        <p>系统提示支付失败，支付后未跳出支付成功界面，可进入“我的“个人页面，在”待支付订单“查看，如显示有待支付订单，再次提交支付即可，如”待支付订单“中为空，请在客户服务区留下您的联系方式，工作人员将尽快与您联系，请确保电话畅通。</p>
        <h4>拼团是否受人数限制</h4>
        <p>朴新教育五周年，感恩回馈老客户。本次小伙伴团报优惠仅限2-3人团报。可以为1名老生带1或2名新生，也可以2名或3名新生共同报名。原班费用根据团报人数均分。<br/>

        举例：五年级语文1500元/科，2人团报750元/人；3人团报500元/人。</p>
        <h4>拼团优惠是否可以与其它优惠共同使用</h4>
        <p>本次小伙伴团报优惠不可与其它任何优惠共同使用，如前期报名已享受优惠，返还助学金时将抵扣相应优惠。举例：原报班级为五年级语文1500元/科，原班享受200元优惠，1300元报入系统。本人为老生开团者，最后3个拼团成功，老生开团者应该享受返还助学金1000元待遇，现场返款时需扣除之前享受的200元优惠，即返款800元。</p>
        <h4>拼团小伙伴中有退班情况怎么办</h4>
        <p>拼团小伙伴人员中如有退班情况，其他小伙伴不再享受相应优惠，并需补齐差价。
        </p>
        <p>举例：2 人团报原价1500元班级，均摊费用报入后750元/人：
        </p>
        <p>【A同学全款1500元报入，B同学优惠价格750报入】
        </p>
        <p>1）不涉及退班的情况下，开课后A同学可返款750元，B不再享受返款；
        </p>
        <p>2）A退班，B需补交750元，按全额1500元报名；
        </p>
        <p>3）B退班，A无需补交费用，B不再享受返款。
        </p>
        <p>举例：3人团报原价1500元班级，均摊费用报入后500元/人：
        </p>
        <p>【A同学全款1500元报入，B同学优惠价格750报入，C同学500元报入】
        </p>
        <p>1）不涉及退班的情况下，开课后A同学可返款1000元，B同学可返款250元，C不再享受返款；
        </p>
        <p>2）A退班，B无需补款，C需补款250元，B和C不再享受返款；
        </p>
        <p>3）B退班，A无需补款，C需补款250元，开课后A同学可返款750元，C不再享受返款；
        </p>
        <p>4）C退班，A无需补款，B无需补交费用，开课后A同学可返款750元，B不再享受返款。
        </p>
        <h4>拼团后优惠的部分如何返还</h4>
        <p>拼团后的助学金将在学校开课后进行返还，根据各地方学校通知为准。</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue, Prop, Emit} from 'vue-property-decorator'

@Component
export default class Introduction extends Vue {
  private title: string = '';
  @Prop(Boolean) private isShowIntr!: boolean;
  @Prop(String) private questionOragree!: string;
  @Emit('closeInParent') public closeMask(show: boolean) {

  }
  private close(): void {
    this.closeMask(false)
  }
}
</script>
<style lang="scss" scoped>
  .intr-mask {
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background: rgba(0,0,0,0.60);

    >div {
      margin: .3rem .2rem .66rem;
      h3 {
        width: 100%;
        height: .5rem;
        line-height: .5rem;
        border-radius: .05rem .05rem 0 0;
        background: #fff;
        font-size: 16px;
        color: #333;
        text-align: center;
        img {
          width: .16rem;
          margin-top: .16rem;
          margin-right: .2rem;
          float: right;
        }
      }
      .content {
        position: absolute;
        top: .8rem;
        left: .2rem;
        right: .2rem;
        bottom: .66rem;
        padding: .06rem .3rem .16rem .16rem;
        overflow-y: scroll;
        background:#e8ebef;
        border-radius: 0 0 .05rem .05rem;
        h4 {
          margin-top: .1rem;
          margin-bottom: .02rem;
          font-size: .14rem;
          color: #666666;
        }
        p {
          font-size: .12rem;
          color: #999999;
          text-align: justify;
          line-height: .18rem;
        }
        &.agreement {
          p {
            font-size: .14rem;
            line-height: .21rem;
            text-indent: 2em;
          }
        }
      }
    }
  }
  
</style>
